app/controllers/logins_controller.rb

SELECT `logins`.* FROM `logins`
---
  def index

    @logins = Login.all

INSERT INTO `logins` (`created_at`, `name`, `updated_at`) VALUES ('2014-10-06 03:53:59', 'minh nguyen', '2014-10-06 03:53:59')
---
  def create
    @login = Login.new(login_params)

    respond_to do |format|
      if @login.save

UPDATE `logins` SET `name` = 'minh thao ', `updated_at` = '2014-10-06 04:17:13' WHERE `logins`.`id` = 1
---
  def update
    respond_to do |format|
      if @login.update(login_params)

DELETE FROM `logins` WHERE `logins`.`id` = 1
---
  def destroy
    @login.destroy

SELECT  `logins`.* FROM `logins`  WHERE `logins`.`id` = 1 LIMIT 1
---
    def set_login
      @login = Login.find(params[:id])